<%@ page language="java" contentType="text/html; charset=utf-8"
	pageEncoding="utf-8" import="java.sql.*"%>
<!DOCTYPE html>
<html lang="ko">
<head>
<meta charset="utf-8">
<title>Welcome To 청춘극장</title>
<link rel="stylesheet" type="text/css" href="./css/main.css" />
<script type="text/javascript" src="./scripts/jquery-1.10.2.min.js"></script>
<script type="text/javascript" src="./scripts/joincheck.js"></script>
</head>

<body>
	<div class="wrap">
		<div class="login">
			<!--Login JSP-->
			<jsp:include page="./loginWidget.jsp" />
		</div>
		<div class="clear"></div>
		<div class="contents">

			<a href="./index.jsp"><h1>Welcome To 청춘극장</h1></a>

			<form method="post" action="Joiner">
				<table>

					<tr>
						<td>ID :</td>
						<td><input type="text" name="id" id="id" /> <input
							type="button" id="userId" value="중복확인" onclick="id_check()" /> <br /></td>
					</tr>

					<tr>
						<td>PASSWORD :</td>
						<td><input type="password" name="password" id="pwd" /> <br />
						</td>
					</tr>
					<tr>
						<td>NAME :</td>
						<td><input type="text" name="name" id="name" /><br /></td>
					</tr>
					<tr>
						<td>ADDRESS :</td>
						<td><input type="text" name="address" id="address" /><br /></td>
					</tr>
					<tr>
						<td>MOBILE :</td>
						<td><input type="text" name="mobile" id="cellphone" /><br /></td>
					</tr>
					<tr>
						<td>EMAIL :</td>
						<td><input type="text" name="email" id="email" /><br /></td>
					</tr>

					<tr>
						<td colspan="2"><textarea name="comments" rows="7" cols="37"
								readonly>
							제 1 장 총 칙

제 1 조 (목적) 

이 이용약관(이하 '약관'이라 합니다)은 강추(이하 '회사'라 합니다)과 이용고객(이하 '회원'이라 합니다)간에 회사가 제공하는 

 웹사이트 강추(www.kangchu.co.kr) 서비스(이하 '서비스'라 합니다)의 가입조건 및 이용에 관한 제반 사항과 기타 필요한 사항을 

 구체적으로 규정함을 목적으로 합니다.



제 2 조 (이용약관의 효력 및 변경) 

(1) 이 약관은 강추 웹사이트(www.kangchu.co.kr 이하 '강추'이라 합니다)에서 온라인으로 공시함으로써 효력을 발생하며, 합리적인 

     사유가 발생할 경우 관련법령에 위배되지 않는 범위 안에서 개정될 수 있습니다. 

      개정된 약관은 온라인에서 공지함으로써 효력을 발휘합니다.



(2) 회사는 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수 있으며, 약관을 변경할 경우에는 지체 없이 이를 공시합니다.

(3) 이 약관에 동의하는 것은 정기적으로 강추를 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다.

     변경된 약관에 대한 정보를 알지 못해 발생하는 이용자의 피해는 회사에서 책임지지 않습니다.



(4) 회원은 변경된 약관에 동의하지 않을 경우 회원 탈퇴(해지)를 요청할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이후에도 거

     부의사를 표시하지 아니하고 서비스를 계속 사용할 경우 약관의 변경 사항에 동의한 것으로 간주됩니다.

  

제 3 조 (약관외 준칙) 

① 이 약관은 회사가 직접 제공하지 않는 업무제휴 서비스(이하 부가서비스라 합니다)는 제외됩니다.

    부가서비스는 해당 서비스의 이용안내에 따릅니다. 

② 이 약관에 명시되지 아니한 사항에 대해서는 관계법령 따라 적용할 수 있습니다.

 
제 4 조 (용어의 정의) 



① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다. 

1.'이용고객'이라 함은 회원제서비스를 이용하는 이용자를 말합니다.

2.'이용계약'이라 함은 서비스 이용과 관련하여 회사와 이용고객 간에 체결 하는 계약을 말합니다. 

3.'이용자번호(ID)'라 함은 이용고객의 식별과 이용고객의 서비스 이용을 위하여 이용고객이 선정하고 회사가 부여하는 문자와 

   숫자의 조합을 말합니다. 

4.'비밀번호'라 함은 이용고객이 부여 받은 이용자번호와 일치된 이용고객 임을 확인하고 이용고객의 권익보호를 위하여 이용고객이
 
    선정한 문자와 숫자의 조합을 말합니다. 

5.'단말기'라 함은 회사가 제공하는 서비스를 이용하기 위해 이용고객이 설치한 개인용 컴퓨터 및 모뎀 등을 말합니다. 

6.'해지'라 함은 회사 또는 회원이 이용계약을 해약하는 것을 말합니다.

  

② 이 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 안내에서 정하는 바에 의합니다. 






제 2 장 이용계약 체결

  

제 5 조 (이용 계약의 성립)



(1) 이용계약은 이용고객의 본 이용약관 내용에 대한 동의와 이용신청에 대하여 회사의 이용승낙으로 성립합니다.

(2) 본 이용약관에 대한 동의는 이용신청 당시 '동의함' 버튼을 누름으로써 의사표시를 합니다.




제 6 조 (서비스 이용 신청)



(1) 회원으로 가입하여 본 서비스를 이용하고자 하는 이용고객은 회사에서 요청하는 제반정보(이름, 주민등록번호, 연락처 등)를 

     제공하여야 합니다.

(2) 모든 회원은 반드시 회원 본인의 이름과 주민등록번호를 제공하여야만 서비스를 이용할 수 있으며, 실명으로 등록하지 않은 

     사용자는 일체의 권리를 주장할 수 없습니다.

(3) 회원가입은 반드시 실명으로만 가입할 수 있으며 회사는 실명확인조치를 할 수 있습니다.

(4) 타인의 명의(이름 및 주민등록번호)를 도용하여 이용신청을 한 회원의 모든 ID는 삭제되며, 관계법령에 따라 처벌을 받을 수 

     있습니다. 

(5) 회사는 본 서비스를 이용하는 회원에 대하여 등급별로 구분하여 이용시간, 이용회수, 서비스 메뉴 등을 세분하여 이용에 차등을 

      둘 수 있습니다.




제 7 조 (개인정보의 보호 및 사용) 



회사는 관계법령이 정하는 바에 따라 이용자 등록정보를 포함한 이용자의 개인정보를 보호하기 위해 노력합니다. 

이용자 개인정보의 보호 및 사용에 대해서는 관련법령 및 회사의 개인정보 보호정책이 적용됩니다.

단, 회사의 공식사이트이외의 웹에서 링크된 사이트에서는 회사의 개인정보 보호정책이 적용되지 않습니다.

또한 회사는 이용자의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다.

  

제 8 조 (이용 신청의 승낙과 제한) 

  

(1) 회사는 제 6조의 규정에 의한 이용신청고객에 대하여 업무 수행상 또는 기술상 지장이 없는 경우에 원칙적으로 접수순서에 따라 

     서비스 이용을 승낙합니다.

(2) 회사는 아래사항에 해당하는 경우에 대해서 승낙하지 아니 합니다.



* 실명이 아니거나 타인의 명의를 이용하여 신청한 경우

* 이용계약 신청서의 내용을 허위로 기재한 경우

* 사회의 안녕과 질서, 미풍양속을 저해할 목적으로 신청한 경우

* 부정한 용도로 본 서비스를 이용하고자 하는 경우 

* 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우 

* 기타 규정한 제반사항을 위반하며 신청하는 경우

* 본 서비스와 경쟁관계에 있는 이용자가 신청하는 경우 

* 기타 규정한 제반사항을 위반하며 신청하는 경우

  

(3) 회사는 서비스 이용신청이 다음 각 호에 해당하는 경우에는 그 신청에 대하여 승낙 제한사유가 해소될 때까지 승낙을 유보할 수 

     있습니다.



* 회사가 설비의 여유가 없는 경우 

* 회사의 기술상 지장이 있는 경우

* 기타 회사의 귀책사유로 이용승낙이 곤란한 경우




(4) 회사는 이용신청고객이 관계법령에서 규정하는 미성년자일 경우에 서비스별 안내에서 정하는 바에 따라 승낙을 보류할 수 

    있습니다.

  

제 9 조 (이용자ID 부여 및 변경 등)

  

(1) 회사는 이용고객에 대하여 약관에 정하는 바에 따라 이용자 ID를 부여합니다.

(2) 이용자ID는 원칙적으로 변경이 불가하며 부득이한 사유로 인하여 변경 하고자 하는 경우에는 해당 ID를 해지하고 재가입해야 

      합니다.

(3) 서비스의 이용자ID는 이용자 본인의 동의하에 회사가 운영하는 자사 사이트의 회원ID와 연결될 수 있습니다.

(4) 이용자ID는 다음 각 호에 해당하는 경우에는 이용고객 또는 회사의 요청으로 변경할 수 있습니다.

  

1. 이용자ID가 이용자의 전화번호 또는 주민등록번호 등으로 등록되어 사생활침해가 우려되는 경우

2. 타인에게 혐오감을 주거나 미풍양속에 어긋나는 경우

3. 기타 합리적인 사유가 있는 경우

  

(5) 서비스 이용자ID 및 비밀번호의 관리책임은 이용자에게 있습니다. 

     이를 소홀이 관리하여 발생하는 서비스 이용상의 손해 또는 제3자에 의한 부정이용 등에 대한 책임은 이용자에게 있으며 회사는 

     그에 대한 책임을 일절 지지 않습니다.

(6) 기타 이용자 개인정보 관리 및 변경 등에 관한 사항은 서비스별 안내에 정하는 바에 의합니다.

					
							</textarea><br /> <span> 예, 동의합니다. <input type="radio" name="chk"
								value="agree" /> &nbsp;&nbsp; 아니요, 동의하지 않습니다. <input
								type="radio" name="chk" value="disagree" />
						</span></td>
					</tr>
					<tr>
						<td colspan="2"><br /> <input type="submit" value="submit"
							onclick="all_check()" /> <input type="reset" value="rewrite" /></td>
					</tr>
				</table>
				<input type="hidden" name="grade" value="1" />
			</form>

		</div>
	</div>

	<footer>
		상호 : 청춘극장 | 전화번호 : 010-9437-2647 | 주소 : 경기도 용인시 처인구 남동 <br> 대표 :
		조수현, 최수지| 사업자 등록번호 123-12-12345 |
	</footer>
</body>
</html>
